In [95]:
# Wind Speed Analysis Project Using Met Ã‰ireann Data

# Step 1: Import Libraries and Load Data
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [96]:
# Load dataset
df = pd.read_csv('mly2921.csv', skiprows=19)
print (df)

     2006  4  0   53.5   9.1  14  14.1
0    2006  5  0  160.3  27.3  22    22
1    2006  6  0   36.0  11.0   7     7
2    2006  7  0   69.8  24.4  15    15
3    2006  8  0   66.6  10.7  15    15
4    2006  9  0  234.1  47.5  20    20
..    ... .. ..    ...   ...  ..   ...
202  2024  4  0   95.3  18.5  21    17
203  2024  5  0   65.1  12.4  12     9
204  2024  6  0   67.6  17.8  15    14
205  2024  7  0   74.6  15.0  19    15
206  2024  8  0  207.4  26.4  27    22

[207 rows x 7 columns]

In [97]:
# The first 5 rows of the dataset.
df.head()

   2006  4  0   53.5   9.1  14  14.1
0  2006  5  0  160.3  27.3  22    22
1  2006  6  0   36.0  11.0   7     7
2  2006  7  0   69.8  24.4  15    15
3  2006  8  0   66.6  10.7  15    15
4  2006  9  0  234.1  47.5  20    20

In [98]:
# The last 5 rows of the dataset.
df.tail()

     2006  4  0   53.5   9.1  14  14.1
202  2024  4  0   95.3  18.5  21    17
203  2024  5  0   65.1  12.4  12     9
204  2024  6  0   67.6  17.8  15    14
205  2024  7  0   74.6  15.0  19    15
206  2024  8  0  207.4  26.4  27    22

In [99]:
# Informations of the dataset.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 207 entries, 0 to 206
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   2006    207 non-null    int64
 1   4       207 non-null    int64
 2   0       207 non-null    int64
 3   53.5    207 non-null    float64
 4   9.1     207 non-null    object
 5   14      207 non-null    int64
 6   14.1    207 non-null    int64
dtypes: float64(1), int64(5), object(1)
memory usage: 11.4+ KB

In [100]:
# Descibe the dataset.
df.describe()

              2006           4           0        53.5          14        14.1
count   207.000000  207.000000  207.000000  207.000000  207.000000  207.000000
mean   2014.951691    6.473430    0.024155  131.940097   19.362319   16.695652
std       5.461923    3.410153    0.153901   67.863286    5.815040    5.941391
min    2006.000000    1.000000    0.000000   12.500000    5.000000    1.000000
25%    2010.000000    4.000000    0.000000   80.050000   15.000000   12.000000
50%    2015.000000    6.000000    0.000000  118.400000   19.000000   17.000000
75%    2020.000000    9.000000    0.000000  178.700000   24.500000   21.000000
max    2024.000000   12.000000    1.000000  366.300000   31.000000   31.000000

In [101]:
# Count the number of null.
df.isnull().sum()

2006    0
4       0
0       0
53.5    0
9.1     0
14      0
14.1    0
dtype: int64